Revit 2026 API

# TextNode Methods

---

The TextNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFormattedText | Returns an FormattedText object that contains text and associated formatting of this TextNode. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

TextNode Class

Autodesk.Revit.DB Namespace